app/mailers/sample_mailer.rb

  def send_when_update(event)
    @event = event
    @group = Group.find(params[:group_id])


    mail to:      @group.group_users.user.email,
         subject: 'イベントが作成されました。'
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "users"."email" FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 9]]