app/views/groups/index.html.erb

  <h2>Groups</h2>
    <% current_user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "group_users" ON "groups"."id" = "group_users"."group_id" WHERE "group_users"."user_id" = ?  [["user_id", 2]]

  <tbody>
    <% current_user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups"