app/views/groups/show.html.erb

SELECT "group_users".* FROM "group_users" WHERE "group_users"."group_id" = ?  [["group_id", 6]]
---
              <td><%= @group.introduction %></td>
              <td><% @group.group_users.each do |f| %>

SELECT  1 AS one FROM "group_users" WHERE "group_users"."group_id" = ? AND "group_users"."user_id" = ? LIMIT ?  [["group_id", 6], ["user_id", 1], ["LIMIT", 1]]
---
              <% if @group.owner_id.to_i != current_user.id.to_i %>
                <% unless GroupUser.exists?(group_id: @group.id, user_id: current_user.id) %>