app/controllers/events_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def new
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "events" ("title", "created_at", "updated_at", "content", "group_id") VALUES (?, ?, ?, ?, ?)  [["title", "メール送れるか7"], ["created_at", "2021-06-05 00:15:23.353778"], ["updated_at", "2021-06-05 00:15:23.353778"], ["content", "メール送れるか7"], ["group_id", "9"]]
---
  def create
    group = Group.find(params[:group_id])
    event = Event.create(event_params)