app/controllers/groups_controller.rb

  def new
    @group = Group.new
    @group.users << current_user
---
INSERT INTO "group_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 5], ["user_id", 2], ["created_at", "2021-06-03 11:58:51.752651"], ["updated_at", "2021-06-03 11:58:51.752651"]]
INSERT INTO "groups" ("name", "created_at", "updated_at", "introduction", "group_image_id", "owner_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ひらめき"], ["created_at", "2021-06-03 11:58:51.746900"], ["updated_at", "2021-06-03 11:58:51.746900"], ["introduction", "ひらめき"], ["group_image_id", nil], ["owner_id", "2"]]

  def create
    @group = Group.new(group_params)
    @group.users << current_user
    @group.owner_id = current_user.id
    if @group.save
---
INSERT INTO "group_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 1], ["user_id", 2], ["created_at", "2021-06-03 08:49:30.621555"], ["updated_at", "2021-06-03 08:49:30.621555"]]
INSERT INTO "groups" ("name", "created_at", "updated_at", "introduction", "group_image_id", "owner_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ひらめき"], ["created_at", "2021-06-03 11:58:51.746900"], ["updated_at", "2021-06-03 11:58:51.746900"], ["introduction", "ひらめき"], ["group_image_id", nil], ["owner_id", "2"]]
INSERT INTO "group_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 9], ["user_id", 1], ["created_at", "2021-06-04 01:38:34.206675"], ["updated_at", "2021-06-04 01:38:34.206675"]]
INSERT INTO "groups" ("name", "created_at", "updated_at", "introduction", "group_image_id", "owner_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tたぶん解決"], ["created_at", "2021-06-04 01:38:34.202293"], ["updated_at", "2021-06-04 01:38:34.202293"], ["introduction", "お願いしますっ"], ["group_image_id", nil], ["owner_id", "1"]]

  def join
    @group = Group.find_by(id: params[:id])
    if !@group.users.include?(current_user)
        @group.users << current_user
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 5], ["id", 1], ["LIMIT", 1]]
INSERT INTO "group_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 5], ["user_id", 1], ["created_at", "2021-06-04 06:06:54.459783"], ["updated_at", "2021-06-04 06:06:54.459783"]]

  def leave
    @group = Group.find_by(id: params[:id])
    @group.users.delete(current_user)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "group_users" WHERE "group_users"."group_id" = ? AND "group_users"."user_id" = ?  [["group_id", 5], ["user_id", 1]]

  def new_mail
    @group = Group.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def send_mail
    @group = Group.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]